OpenFOAM10/slotburner/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
 (0.0  0.0   -0.01)
 (0.0  0.01  -0.01)
 (0.0  0.015 -0.01)
 (0.0  0.025 -0.01)
 (0.04 0.025 -0.01)
 (0.04 0.015 -0.01)
 (0.04 0.01 -0.01)
 (0.04 0.0 -0.01)

 (0.0  0.0   0.01)
 (0.0  0.01  0.01)
 (0.0  0.015 0.01)
 (0.0  0.025 0.01)
 (0.04 0.025 0.01)
 (0.04 0.015 0.01)
 (0.04 0.01 0.01)
 (0.04 0.0 0.01)
 
);

blocks
(
 hex (0 7 6 1 8 15 14 9 ) (128 128 1) simpleGrading (1 1 1)
 hex (1 6 5 2 9 14 13 10 ) (128 128 1) simpleGrading (1 1 1)
 hex (2 5 4 3 10 13 12 11) (128 128 1) simpleGrading (1 1 1)
 
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
	 (1 9 10 2)
    	 (0 8 9 1)
	 (2 10 11 3)
	 );
    }
    
    
    outlet
    {
        type patch;
        faces
        (
	 (0 7 15 8)
	 (7 6 14 15)
	 (6 5 13 14)
	 (5 4 12 13)
	 (4 3 11 12)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
	 (0 1 6 7)
	 (1 2 5 6)
	 (2 3 4 5)
        );
    }
);


// ************************************************************************* //
