OpenFOAM10/slotburner/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
49152
(
(0.00015625 3.90625e-05 0)
(0.00046875 3.90625e-05 1.20467e-20)
(0.00078125 3.90625e-05 0)
(0.00109375 3.90625e-05 -5.75547e-19)
(0.00140625 3.90625e-05 -5.75547e-19)
(0.00171875 3.90625e-05 0)
(0.00203125 3.90625e-05 0)
(0.00234375 3.90625e-05 0)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
384
(
(0 0.0100195 0)
(0 0.0100586 0)
(0 0.0100977 0)
(0 0.0101367 0)
(0 0.0101758 0)
(0 0.0102148 0)
(0 0.0102539 0)
(0 0.010293 0)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
640
(
(0.00015625 0 0)
(0.00046875 0 0)
(0.00078125 0 0)
(0.00109375 0 0)
(0.00140625 0 0)
(0.00171875 0 0)
(0.00203125 0 0)
(0.00234375 0 0)
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
