OpenFOAM10/slotburner/0/CH4
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CH4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar>
384
(
0.055187000000000000
0.055187000000000000
0.055187000000000000
0.055187000000000000
0.055187000000000000
0.055187000000000000
0.055187000000000000
0.055187000000000000
...
);
    }
    /*    air
   / {
    /    type            fixedValue;
        value           uniform 0.0;
    }
    */
    outlet
    {
            type zeroGradient;

	    //        type            inletOutlet;
	    // inletValue      uniform 0.0;
	    // value           uniform 0.0;

    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
