OpenFOAM10/slotburner/0/CO2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CO2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    /*    air
    {
        type            fixedValue;
        value           uniform 0;
    }*/
    outlet
    {
            type zeroGradient;

	    //        type            inletOutlet;
	    // inletValue      uniform 0;
	    //value           uniform 0;

    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
