OpenFOAM10/slotburner/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
49152
(
0.00015625
0.00046875
0.00078125
0.00109375
0.00140625
0.00171875
0.00203125
0.00234375
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
640
(
0.00015625
0.00046875
0.00078125
0.00109375
0.00140625
0.00171875
0.00203125
0.00234375
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
