OpenFOAM10/slotburner/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
49152
(
3.90625e-05
3.90625e-05
3.90625e-05
3.90625e-05
3.90625e-05
3.90625e-05
3.90625e-05
3.90625e-05
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
384
(
0.0100195
0.0100586
0.0100977
0.0101367
0.0101758
0.0102148
0.0102539
0.010293
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
640
(
0
0
0
0
0
0
0
0
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
