OpenFOAM10/slotburner/0/N2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar>
384
(
0.000000000000000000
0.000000000000000000
0.000000000000000000
0.000000000000000000
0.000000000000000000
0.000000000000000000
0.000000000000000000
0.000000000000000000
...
        );
    }
    /*    air
    {
        type            fixedValue;
        value           uniform 0.77;
    }*/
    outlet
    {
            type zeroGradient;

	    //        type            inletOutlet;
	    //inletValue      uniform 1;
	    //value           uniform 1;

    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
