OpenFOAM10/slotburner/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 1500;

boundaryField
{
    inlet
    {
     type            fixedValue;
     value           uniform 293;
     //	type zeroGradient;
	
    }
    /*    air
    {
        type            fixedValue;
        value           uniform 293;
	}*/
    outlet
    {
            type zeroGradient;

    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
